Documents/АктПриемкиГабаритныхЧертежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктПриемкиГабаритныхЧертежей</Name>
			<BasedOn>
				<xr:Item>Document.ВыездНаЗамер</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыездНаЗамер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГабаритныеЧертежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГабаритныйЧертеж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Соглосователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Соглосователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСоглосования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодписьОтозвана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтозвания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтозвания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СостояниеЗамера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостояниеЗамера</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЗамера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗамера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектИзменения</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ПроверитьГабаритныеЧертежи</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиГабаритныхЧертежей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОбъектыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОбъектыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеДлительностиПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполненияДлительностиМонтажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовитьОзнакомительныйВыезд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверятьГабаритныеЧерчежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительЗамера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗапускВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НазначениеАвтораДляЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НазначениеАвтораДляЗадачи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/АктПриемкиГабаритныхЧертежей/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыездНаЗамер") Тогда
		// Заполнение шапки
		Автор 		= ПараметрыСеанса.ТекущийПользователь;
		Проект 		= ДанныеЗаполнения.Проект;
		Основание 	= ДанныеЗаполнения.Ссылка;
		
		Для Каждого ТекСтрокаГабаритныеЧерчежи Из ДанныеЗаполнения.ГабаритныеЧертежи Цикл
			Если ТекСтрокаГабаритныеЧерчежи.ЗамерПроизведен Тогда
				
				НоваяСтрока 					= ГабаритныеЧертежи.Добавить();
				НоваяСтрока.ГабаритныйЧертеж 	= ТекСтрокаГабаритныеЧерчежи.ГабаритныйЧертеж;
				НоваяСтрока.Комментарий 		= ТекСтрокаГабаритныеЧерчежи.Комментарий;
				
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПолучитьГЧДляИзменения();
КонецПроцедуры

Функция ПолучитьГЧДляИзменения()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежиТЧ.ГабаритныйЧертеж КАК ГабаритныйЧертеж
		|ПОМЕСТИТЬ ГабаритныеЧертежиТЧ
		|ИЗ
		|	&ГабаритныеЧертежиТЧ КАК ГабаритныеЧертежиТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГабаритныеЧертежиТЧ.ГабаритныйЧертеж КАК ГабаритныйЧертеж
		|ПОМЕСТИТЬ НЕСозданныеЗадачиПоГЧ
		|ИЗ
		|	ГабаритныеЧертежиТЧ КАК ГабаритныеЧертежиТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ПроверитьГабаритныеЧертежи КАК ПроверитьГабаритныеЧертежи
		|		ПО ГабаритныеЧертежиТЧ.ГабаритныйЧертеж = ПроверитьГабаритныеЧертежи.ГабаритныйЧертеж
		|			И (ПроверитьГабаритныеЧертежи.Основание = &Ссылка)
		|ГДЕ
		|	ПроверитьГабаритныеЧертежи.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НЕСозданныеЗадачиПоГЧ.ГабаритныйЧертеж КАК ГабаритныйЧертеж
		|ПОМЕСТИТЬ втГЧ
		|ИЗ
		|	НЕСозданныеЗадачиПоГЧ КАК НЕСозданныеЗадачиПоГЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктПриемкиГабаритныхЧертежей.ГабаритныеЧертежи КАК АктПриемкиГабаритныхЧертежейГабаритныеЧертежи
		|		ПО (АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж = НЕСозданныеЗадачиПоГЧ.ГабаритныйЧертеж)
		|			И (АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.Ссылка.Проведен)
		|			И (АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.Ссылка.Дата > &Дата)
		|ГДЕ
		|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втГЧ.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
		|	ЕСТЬNULL(СостояниеЗамераСрезПоследних.СтатусЗамера, ЗНАЧЕНИЕ(Перечисление.СтатусыЗамера.ПустаяСсылка)) КАК Статус
		|ПОМЕСТИТЬ втГЧССотоянием
		|ИЗ
		|	втГЧ КАК втГЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеЗамера.СрезПоследних(&Дата, ОбъектЗамера В (&ГабаритныйЧертеж)) КАК СостояниеЗамераСрезПоследних
		|		ПО втГЧ.ГабаритныйЧертеж = СостояниеЗамераСрезПоследних.ОбъектЗамера
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втГЧССотоянием.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
		|	втГЧССотоянием.ГабаритныйЧертеж.Наименование КАК ГабаритныйЧертежНаименование,
		|	втГЧССотоянием.ГабаритныйЧертеж.Проект КАК Проект
		|ИЗ
		|	втГЧССотоянием КАК втГЧССотоянием
		|ГДЕ
		|	втГЧССотоянием.Статус <> &СтатусЗамера
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НазначениеАвтораДляЗадачи.Исполнитель КАК Исполнитель
		|ИЗ
		|	Справочник.НазначениеАвтораДляЗадачи КАК НазначениеАвтораДляЗадачи
		|ГДЕ
		|	НазначениеАвтораДляЗадачи.ОбъектЗадачи = ЗНАЧЕНИЕ(Перечисление.ОбъектыЗадач.ПроверятьГабаритныеЧерчежи)";
	
	Запрос.УстановитьПараметр("ГабаритныеЧертежиТЧ", 	ГабаритныеЧертежи.Выгрузить(, "ГабаритныйЧертеж"));
	Запрос.УстановитьПараметр("ГабаритныйЧертеж", 		ГабаритныеЧертежи.ВыгрузитьКолонку("ГабаритныйЧертеж"));
	Запрос.УстановитьПараметр("Дата", 					Дата);
	Запрос.УстановитьПараметр("СтатусЗамера", 			НовыйСтатус);
	Запрос.УстановитьПараметр("Ссылка", 				Ссылка);
	
	Результат = Запрос.ВыполнитьПакет(); 
	
	Исполнитель = Неопределено;
	Выборка = Результат[5].Выбрать();
	Пока Выборка.Следующий() Цикл
		Исполнитель = Выборка.Исполнитель;
	КонецЦикла;
	
	
	//Выборка = Результат[4].Выбрать();                   
	//Пока Выборка.Следующий() Цикл
	//	СоздатьЗадачуПроверитьГабаритныеЧертежи(Выборка, Исполнитель);
	//КонецЦикла;
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
		|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж.Наименование КАК ГабаритныйЧертежНаименование,
		|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж.Проект КАК Проект
		|ИЗ
		|	Документ.АктПриемкиГабаритныхЧертежей.ГабаритныеЧертежи КАК АктПриемкиГабаритныхЧертежейГабаритныеЧертежи
		|ГДЕ
		|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоздатьЗадачуПроверитьГабаритныеЧертежи(ВыборкаДетальныеЗаписи, Исполнитель);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	

КонецФункции // ПолучитьГЧДляИзменения()

Процедура СоздатьЗадачуПроверитьГабаритныеЧертежи(Выборка, Исполнитель)

	ЗадачаПроверки = Задачи.ПроверитьГабаритныеЧертежи.СоздатьЗадачу();
	ЗадачаПроверки.Дата 					= ТекущаяДата();
	ЗадачаПроверки.Основание 				= Ссылка;
	ЗадачаПроверки.ГабаритныйЧертеж 		= Выборка.ГабаритныйЧертеж;
	ЗадачаПроверки.Исполнитель 				= Исполнитель;
	ЗадачаПроверки.Наименование				= Выборка.ГабаритныйЧертежНаименование + ".Проверка";	
	ЗадачаПроверки.Проект					= Выборка.Проект;	
	ЗадачаПроверки.НовыйСтатус				= НовыйСтатус;	
	ЗадачаПроверки.КрайняяДатаИсполнения	= ЗадачаПроверки.Дата + 7 * 24 * 3600;	
	ЗадачаПроверки.БылаКорректировка		= 0;	
	
	ЗадачаПроверки.Записать();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		Префикс = Проект.Префикс + "-";
		УстановитьНовыйНомер(Префикс); 
	КонецЕсли;
КонецПроцедуры
